app/views/articles/_article.html.erb

SELECT  1 AS one FROM "articles" INNER JOIN "articles_users" ON "articles"."id" = "articles_users"."article_id" WHERE "articles_users"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", 4], ["id", 122]]
---
          <div class="fav">
            <%if current_user.fav_articles.include? article %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 122]]
---
            <div class="c_value">
                <%= article.comments.count %>