app/views/articles/_favorite.html.erb

         </a>
         <%if current_user.fav_articles.include? @article %>
---
SELECT  1 AS one FROM "articles" INNER JOIN "articles_users" ON "articles"."id" = "articles_users"."article_id" WHERE "articles_users"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", 4], ["id", 116]]