app/views/articles/show.html.erb

SELECT "invites".* FROM "invites" WHERE "invites"."article_id" = ?  ORDER BY "invites"."created_at" DESC  [["article_id", 107]]
SELECT COUNT(*) FROM "invites" WHERE "invites"."article_id" = ?  [["article_id", 107]]
---
  <div class="share_head">
     SHARED WITH (<%=@article.invites.count%>)