app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 116]]
SELECT "invites".* FROM "invites" WHERE "invites"."article_id" = ?  ORDER BY "invites"."created_at" DESC  [["article_id", 107]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 5 OFFSET 0  [["article_id", 116]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 116]]
SELECT COUNT(*) FROM "invites" WHERE "invites"."article_id" = ?  [["article_id", 107]]
SELECT COUNT(*) FROM "users" INNER JOIN "articles_users" ON "users"."id" = "articles_users"."user_id" WHERE "articles_users"."article_id" = ?  [["article_id", 116]]
---
 def show
   @users = User.where("id NOT IN (?)",current_user)
     @article = Article.find(params[:id])
     if @article.user_id == current_user.id || @article.visibility == "public" || Invite.where(:user_id => current_user.id , :article_id => @article.id ,:invite_accepted => 'true').present?
          @sub_articles = @article.sub_articles
      else
        render :file => 'public/422.html'
      end
      @comments = Comment.where(:article_id => @article.id).paginate(:per_page => 5, :page => params[:page])

SELECT  "articles".* FROM "articles" WHERE "articles"."visibility" = ?  ORDER BY "articles"."created_at" DESC LIMIT 9 OFFSET 0  [["visibility", "public"]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."visibility" = ?  [["visibility", "public"]]
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 9 OFFSET 0  [["user_id", 4]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 4]]
---
  def index
    if params[:tag]
      @tags = true
      @articles = Article.joins(:tags).where('tags.name like ?', "%#{params[:tag]}%").paginate(:per_page => 5, :page => params[:page])
    elsif params[:type]== 'private'
      @articles = Article.joins(:invites).where(:invites => { :user_id => current_user.id , :status => 'true' }).paginate(:per_page => 5, :page => params[:page])

    elsif params[:type]== 'public'
        @articles = Article.where(:visibility => 'public').paginate(:per_page => 5, :page => params[:page])

    elsif params[:type]== 'my'
        @articles = Article.where(:user_id => current_user.id).paginate(:per_page => 5, :page => params[:page])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 127]]
UPDATE "articles" SET "updated_at" = ? WHERE "articles"."id" = ?  [["updated_at", "2015-11-04 10:07:39.939766"], ["id", 127]]
---
def update
  @article = Article.find(params[:id])

  if @article.update(article_params)

SELECT "tags"."name" FROM "tags" JOIN (SELECT taggings.tag_id FROM "taggings" WHERE (taggings.taggable_type = 'Article' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT articles.id FROM "articles"  ORDER BY "articles"."created_at" DESC)) GROUP BY taggings.tag_id) AS taggings ON taggings.tag_id = tags.id
---
def set_available_tags_to_gon
  gon.available_tags = Article.tags_on(:tags).pluck(:name)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 128]]
---
def set_article
  @article = Article.find(params[:id])