app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."parent_id" = ?  ORDER BY "articles"."created_at" DESC  [["parent_id", 116]]
---
 def show
   @users = User.all
     @article = Article.find(params[:id])
   @subarticles = Article.where(:parent_id => @article.id )