app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ?  ORDER BY "articles"."created_at" DESC LIMIT 1  [["id", 127]]
INSERT INTO "comments" ("body", "article_id", "user_id", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "<p>ghjughuytuytu</p>\r\n"], ["article_id", 127], ["user_id", 4], ["commenter", "nidhin"], ["created_at", "2015-11-04 09:08:03.231266"], ["updated_at", "2015-11-04 09:08:03.231266"]]
---
  def create
   @article = Article.find(params[:article_id])
   @comment = @article.comments.new(comment_params)
   @comment.user = current_user
   @comment.commenter = current_user.username
   @comment.save